[net]
width=480
height=480
channels=3
letter_box=1

# Conv

[convolutional]
batch_normalize=1
filters=32
size=6
stride=2
pad=2
activation=silu

# Conv

[convolutional]
batch_normalize=1
filters=64
size=3
stride=2
pad=1
activation=silu

# C3

[convolutional]
batch_normalize=1
filters=32
size=1
stride=1
pad=0
activation=silu

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=32
size=1
stride=1
pad=0
activation=silu

[convolutional]
batch_normalize=1
filters=32
size=1
stride=1
pad=0
activation=silu

[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=silu

[shortcut]
from=-3
activation=linear

[route]
layers=-1, -6

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=0
activation=silu

# Conv

[convolutional]
batch_normalize=1
filters=128
size=3
stride=2
pad=1
activation=silu

# C3

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=0
activation=silu

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=0
activation=silu

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=0
activation=silu

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=silu

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=0
activation=silu

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=silu

[shortcut]
from=-3
activation=linear

[route]
layers=-1, -9

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=0
activation=silu

# Conv

[convolutional]
batch_normalize=1
filters=256
size=3
stride=2
pad=1
activation=silu

# C3

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=0
activation=silu

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=0
activation=silu

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=0
activation=silu

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=silu

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=0
activation=silu

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=silu

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=0
activation=silu

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=silu

[shortcut]
from=-3
activation=linear

[route]
layers=-1, -12

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=0
activation=silu

# Conv

[convolutional]
batch_normalize=1
filters=512
size=3
stride=2
pad=1
activation=silu

# C3

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=0
activation=silu

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=0
activation=silu

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=0
activation=silu

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=silu

[shortcut]
from=-3
activation=linear

[route]
layers=-1, -6

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=0
activation=silu

# SPPF

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=0
activation=silu

[maxpool]
stride=1
size=5

[maxpool]
stride=1
size=5

[maxpool]
stride=1
size=5

[route]
layers=-4, -3, -2, -1

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=0
activation=silu

# Conv

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=0
activation=silu

# Upsample

[upsample]
stride=2

# Concat

[route]
layers=-1, 36

# C3

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=0
activation=silu

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=0
activation=silu

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=0
activation=silu

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=silu

[route]
layers=-1, -5

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=0
activation=silu

# Conv

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=0
activation=silu

# Upsample

[upsample]
stride=2

# Concat

[route]
layers=-1, 21

# C3

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=0
activation=silu

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=0
activation=silu

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=0
activation=silu

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=silu

[route]
layers=-1, -5

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=0
activation=silu

# Conv

[convolutional]
batch_normalize=1
filters=128
size=3
stride=2
pad=1
activation=silu

# Concat

[route]
layers=-1, 62

# C3

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=0
activation=silu

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=0
activation=silu

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=0
activation=silu

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=silu

[route]
layers=-1, -5

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=0
activation=silu

# Conv

[convolutional]
batch_normalize=1
filters=256
size=3
stride=2
pad=1
activation=silu

# Concat

[route]
layers=-1, 52

# C3

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=0
activation=silu

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=0
activation=silu

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=0
activation=silu

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=silu

[route]
layers=-1, -5

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=0
activation=silu

# Detect

[route]
layers=71

[convolutional]
filters=33
size=1
stride=1
pad=0
activation=logistic

[yolo]
mask=0, 1, 2
anchors=5.3046875, 4.59765625, 8.6875, 5.7890625, 22.875, 20.15625, 46.71875, 41.84375, 29.828125, 76.0625, 72.4375, 46.34375, 217.125, 178.75, 246.375, 220.125, 302.0, 276.5
classes=6
num=9
scale_x_y=2.0
new_coords=1

[route]
layers=80

[convolutional]
filters=33
size=1
stride=1
pad=0
activation=logistic

[yolo]
mask=3, 4, 5
anchors=5.3046875, 4.59765625, 8.6875, 5.7890625, 22.875, 20.15625, 46.71875, 41.84375, 29.828125, 76.0625, 72.4375, 46.34375, 217.125, 178.75, 246.375, 220.125, 302.0, 276.5
classes=6
num=9
scale_x_y=2.0
new_coords=1

[route]
layers=89

[convolutional]
filters=33
size=1
stride=1
pad=0
activation=logistic

[yolo]
mask=6, 7, 8
anchors=5.3046875, 4.59765625, 8.6875, 5.7890625, 22.875, 20.15625, 46.71875, 41.84375, 29.828125, 76.0625, 72.4375, 46.34375, 217.125, 178.75, 246.375, 220.125, 302.0, 276.5
classes=6
num=9
scale_x_y=2.0
new_coords=1
